ChartsOfCharacteristicTypes/ЛБ_НастройкиЛомбард.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ЛБ_НастройкиЛомбард</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:EnumRef.ЛБ_ПечатныеФормыКарточкиКлиента</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>10</v8:Digits>
					<v8:FractionDigits>0</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>10</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ЛБ_НастройкиЛомбард</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеВСписке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ЛБ_НастройкиЛомбард</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

ChartsOfCharacteristicTypes/ЛБ_НастройкиЛомбард/Ext/ManagerModule.bsl
Функция ПолучитьЗначениеНастройки(Настройка) Экспорт
	
	ЗначениеНастройки = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЛБ_НастройкиЛомбард.Значение КАК Значение
	|ИЗ
	|	ПланВидовХарактеристик.ЛБ_НастройкиЛомбард КАК ЛБ_НастройкиЛомбард
	|ГДЕ
	|	ЛБ_НастройкиЛомбард.Ссылка = &Ссылка
	|	И НЕ ЛБ_НастройкиЛомбард.ЗначениеВСписке
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛБ_НастройкиЛомбардСписокЗначений.Значение
	|ИЗ
	|	ПланВидовХарактеристик.ЛБ_НастройкиЛомбард.СписокЗначений КАК ЛБ_НастройкиЛомбардСписокЗначений
	|ГДЕ
	|	ЛБ_НастройкиЛомбардСписокЗначений.Ссылка = &Ссылка
	|	И ЛБ_НастройкиЛомбардСписокЗначений.Ссылка.ЗначениеВСписке";
	
	Запрос.УстановитьПараметр("Ссылка", Настройка);
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		ЗначениеНастройки.Добавить(Результат.Значение);
	КонецЦикла;
	
	Возврат ЗначениеНастройки;
	
КонецФункции
